



IPv6 Operations (v6ops)                                J. Palet Martinez
Internet-Draft                                          The IPv6 Company
Updates: RFC7084 (if approved)                              H. M.-H. Liu
Intended status: Informational                      D-Link Systems, Inc.
Expires: October 29, 2018                                   M. Kawashima
                                                     NEC Platforms, Ltd.
                                                          April 27, 2018


Requirements for IPv6 Customer Edge Routers to Support IPv4 Connectivity
                              as-a-Service
                 draft-ietf-v6ops-transition-ipv4aas-00

Abstract

   This document specifies the IPv4 service continuity requirements for
   an IPv6 Customer Edge (CE) router, either provided by the service
   provider or thru the retail market.

   Specifically, this document extends the "Basic Requirements for IPv6
   Customer Edge Routers" ([RFC7084]) in order to allow the provisioning
   of IPv6 transition services for the support of "IPv4 as-a-Service"
   (IPv4aaS) by means of new transition mechanisms, which were not
   available at the time [RFC7084] (Basic Requirements for IPv6 Customer
   Edge Routers) was published.  The document only covers transition
   technologies for delivering IPv4 in IPv6-only access networks,
   commonly called "IPv4 as-a-Service" (IPv4aaS), as required in a world
   where IPv4 addresses are no longer available, so hosts in the
   customer LANs with IPv4-only or IPv6-only applications or devices,
   requiring to communicate with IPv4-only services at the Internet, are
   still able to do so.

   This document updates section 4.4 (Transition Technologies
   Requirements) of [RFC7084].

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at https://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference



Palet Martinez, et al.  Expires October 29, 2018                [Page 1]

Internet-Draft       IPv6 Transition CE for IPv4aaS           April 2018


   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on October 29, 2018.

Copyright Notice

   Copyright (c) 2018 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (https://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3
     1.1.  Requirements Language - Special Note  . . . . . . . . . .   3
   2.  Terminology . . . . . . . . . . . . . . . . . . . . . . . . .   4
   3.  Requirements  . . . . . . . . . . . . . . . . . . . . . . . .   4
     3.1.  General Requirements  . . . . . . . . . . . . . . . . . .   4
     3.2.  LAN-Side Configuration  . . . . . . . . . . . . . . . . .   4
     3.3.  Transition Technologies Support for IPv4 service
           continuity        (IPv4 as-a-Service - IPv4aaS) . . . . .   5
       3.3.1.  464XLAT . . . . . . . . . . . . . . . . . . . . . . .   5
       3.3.2.  Dual-Stack Lite (DS-Lite) . . . . . . . . . . . . . .   6
       3.3.3.  Lightweight 4over6 (lw4o6)  . . . . . . . . . . . . .   7
       3.3.4.  MAP-E . . . . . . . . . . . . . . . . . . . . . . . .   8
       3.3.5.  MAP-T . . . . . . . . . . . . . . . . . . . . . . . .   8
   4.  IPv4 Multicast Support  . . . . . . . . . . . . . . . . . . .   9
   5.  UPnP IGD-PCP IWF Support  . . . . . . . . . . . . . . . . . .   9
   6.  Update of RFC7084 . . . . . . . . . . . . . . . . . . . . . .   9
   7.  Code Considerations . . . . . . . . . . . . . . . . . . . . .   9
   8.  Security Considerations . . . . . . . . . . . . . . . . . . .  10
   9.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .  10
   10. Annex A: Usage Scenarios  . . . . . . . . . . . . . . . . . .  10
   11. Annex B: End-User Network Architecture  . . . . . . . . . . .  12
   12. References  . . . . . . . . . . . . . . . . . . . . . . . . .  15
     12.1.  Normative References . . . . . . . . . . . . . . . . . .  15
     12.2.  Informative References . . . . . . . . . . . . . . . . .  17
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  18





Palet Martinez, et al.  Expires October 29, 2018                [Page 2]

Internet-Draft       IPv6 Transition CE for IPv4aaS           April 2018


1.  Introduction

   This document defines IPv4 service continuity features over an
   IPv6-only network, for a residential or small-office router, referred
   to as an "IPv6 CE Router with IPv4aaS support", in order to establish
   an industry baseline for transition features to be implemented on
   such a router.

   These routers are likely to rely upon "Basic Requirements for IPv6
   Customer Edge Routers" ([RFC7084]), so the scope of this document is
   to ensure the IPv4 "service continuity" support, in the LAN side and
   the access to IPv4-only Internet services from an IPv6-only access
   WAN even from IPv6-only applications or devices in the LAN side.

   This document covers a set of IP transition techniques required when
   ISPs have an IPv6-only access network.  This is a common situation in
   a world where IPv4 addresses are no longer available, so the service
   providers need to provision IPv6-only WAN access.  At the same time,
   they need to ensure that both IPv4-only and IPv6-only devices or
   applications in the customer networks, can still reach IPv4-only
   devices and applications in the Internet.

   This document specifies the IPv4 service continuity mechanisms to be
   supported by an IPv6 Transition CE Router, and relevant provisioning
   or configuration information differences from [RFC7084].

   This document is not a recommendation for service providers to use
   any specific transition mechanism.

   Automatic provisioning of more complex topology than a single router
   with multiple LAN interfaces may be handled by means of HNCP
   ([RFC7788]), which is out of the scope of this document.

   Service providers who specify feature sets for CE Routers MAY specify
   a different set of features than those included in this document.
   Since it is impossible to know prior to sale which transition
   mechanism a device will need over the lifetime of the device, IPv6 CE
   Routers intended for the retail market MUST support all of them.

   A complete description of "Usage Scenarios" and "End-User Network
   Architecture" is provided in Annex A and B, respectively.

1.1.  Requirements Language - Special Note

   Unlike other IETF documents, the key words "MUST", "MUST NOT",
   "REQUIRED", "SHALL", "SHALL NOT", "SHOULD", "SHOULD NOT",
   "RECOMMENDED", "MAY", and "OPTIONAL" in this document are not used as
   described in RFC 2119 [RFC2119].  This document uses these keywords



Palet Martinez, et al.  Expires October 29, 2018                [Page 3]

Internet-Draft       IPv6 Transition CE for IPv4aaS           April 2018


   not strictly for the purpose of interoperability, but rather for the
   purpose of establishing industry-common baseline functionality.  As
   such, the document points to several other specifications to provide
   additional guidance to implementers regarding any protocol
   implementation required to produce a successful IPv6 Transition CE
   Router that interoperates successfully with a particular subset of
   currently deploying and planned common IPv6-only access networks.

2.  Terminology

   This document uses the same terms as in [RFC7084], with minor
   clarifications.

   "IPv4aaS" stands for "IPv4 as-a-Service", meaning transition
   technologies for delivering IPv4 in IPv6-only access networks.

   The term "IPv6 transition Customer Edge Router with IPv4aaS"
   (shortened as "CE Router" or "IPv6 CE Router") is defined as an "IPv6
   Customer Edge Router" that provides features for the delivery of IPv4
   services over an IPv6-only WAN network including IPv6-IPv4
   communications.

   The "WAN Interface" term used across this document, means that can
   also support link technologies based in Internet-layer (or higher-
   layers) "tunnels", such as IPv4-in-IPv6 tunnels.

3.  Requirements

   The CE Router MUST comply with [RFC7084] (Basic Requirements for IPv6
   Customer Edge Routers), with the exception of Section 4.4, which
   becomes updated by this document.

3.1.  General Requirements

   A new general requirement is added, in order to ensure that the CE
   Router respects the IPv6 prefix length as a parameter:

   G-6 The IPv6-only CE Router MUST comply with [RFC7608] (IPv6 Prefix
   Length Recommendation for Forwarding).

3.2.  LAN-Side Configuration

   A new LAN requirement is added, which in fact is common in regular CE
   Router, and it is required by most of the transition mechanisms:

   L-15 The IPv6 CE Router SHOULD implement a DNS proxy as described in
   [RFC5625] (DNS Proxy Implementation Guidelines).




Palet Martinez, et al.  Expires October 29, 2018                [Page 4]

Internet-Draft       IPv6 Transition CE for IPv4aaS           April 2018


3.3.  Transition Technologies Support for IPv4 service continuity (IPv4
      as-a-Service - IPv4aaS)

   The main target of this document is the support of IPv6-only WAN
   access.  To enable legacy IPv4 functionality, this document also
   includes the support of IPv4-only devices and applications in the
   customers LANs, as well as IPv4-only services on the Internet.  Thus,
   both IPv4-only and the IPv6-only devices inside the CE Router are
   able to reach the IPv4-only services.

   This document takes no position on simultaneous operation of any
   transition mechanism and native IPv4.

   In order to seamlessly provide the IPv4 Service Continuity in
   Customer LANs, allowing an automated IPv6 transition mechanism
   provisioning, a new general transition requirement is added.

   General transition requirements:

   TRANS-1:  If more than one S46 mechanism is supported, the CE Router
             MUST support the DHCPv6 S46 priority option described in
             [RFC8026] (Unified IPv4-in-IPv6 Softwire Customer Premises
             Equipment (CPE): A DHCPv6-Based Prioritization Mechanism).

   TRANS-2:  The CE Router MUST verify if the WAN link supports native
             IPv4.  In that case, transition mechanisms SHOULD NOT be
             automatically enabled for that interface.

   TRANS-3:  If native IPv4 is not available and 464XLAT [RFC6877] is
             supported, the CE Router MUST enable the CLAT (in order to
             automatically configure 464XLAT [RFC6877]).  If 464XLAT
             [RFC6877] is not supported, and more than one S46 mechanism
             is supported, following Section 1.4 of [RFC8026], MUST
             check for a valid match in OPTION_S46_PRIORITY, which will
             allow configuring any of the other transition mechanisms.

   The following sections describe the requirements for supporting
   transition mechanisms.

3.3.1.  464XLAT

   464XLAT [RFC6877] is a technique to provide IPv4 service over an
   IPv6-only access network without encapsulation.  This architecture
   assumes a NAT64 [RFC6146] (Stateful NAT64: Network Address and
   Protocol Translation from IPv6 Clients to IPv4 Servers) function
   deployed at the service provider or a third-party network.

   The CE Router SHOULD support CLAT functionality.  If 464XLAT is



Palet Martinez, et al.  Expires October 29, 2018                [Page 5]

Internet-Draft       IPv6 Transition CE for IPv4aaS           April 2018


   supported, it MUST be implemented according to [RFC6877].  The
   following CE Router requirements also apply:

   464XLAT requirements:

   464XLAT-1:  The CE Router MUST perform IPv4 Network Address
               Translation (NAT) on IPv4 traffic translated using the
               CLAT, unless a dedicated /64 prefix has been acquired
               using DHCPv6-PD [RFC3633] (IPv6 Prefix Options for
               DHCPv6).

   464XLAT-2:  The CE Router SHOULD support IGD-PCP IWF [RFC6970] (UPnP
               Internet Gateway Device - Port Control Protocol
               Interworking Function).

   464XLAT-3:  If PCP ([RFC6887]) is implemented, the CE Router MUST
               also implement [RFC7291] (DHCP Options for the PCP).  If
               no PCP server is configured, the CE Router MAY verify if
               the default gateway, or the NAT64 is the PCP server.  A
               plain IPv6 mode is used to send PCP requests to the
               server.

   464XLAT-4:  The CE Router MUST implement [RFC7050] (Discovery of the
               IPv6 Prefix Used for IPv6 Address Synthesis) in order to
               discover the PLAT-side translation IPv4 and IPv6
               prefix(es)/suffix(es).  The CE Router MUST follow
               [RFC7225] (Discovering NAT64 IPv6 Prefixes Using the
               PCP), in order to learn the PLAT-side translation IPv4
               and IPv6 prefix(es)/suffix(es) used by an upstream PCP-
               controlled NAT64 device.

3.3.2.  Dual-Stack Lite (DS-Lite)

   Dual-Stack Lite [RFC6333] enables both continued support for IPv4
   services and incentives for the deployment of IPv6.  It also de-
   couples IPv6 deployment in the service provider network from the rest
   of the Internet, making incremental deployment easier.  Dual-Stack
   Lite enables a broadband service provider to share IPv4 addresses
   among customers by combining two well-known technologies: IP in IP
   (IPv4-in-IPv6) and Network Address Translation (NAT).  It is expected
   that DS-Lite traffic is forwarded over the IPv6 CE Router's native
   IPv6 WAN interface, and not encapsulated in another tunnel.

   The IPv6 CE Router SHOULD implement DS-Lite [RFC6333] functionality.
   If DS-Lite is supported, it MUST be implemented according to
   [RFC6333].  The following CE Router requirements also apply:

   DS-Lite requirements:



Palet Martinez, et al.  Expires October 29, 2018                [Page 6]

Internet-Draft       IPv6 Transition CE for IPv4aaS           April 2018


   DSLITE-1:  The IPv6 CE Router MUST support configuration of DS-Lite
              via the DS-Lite DHCPv6 option [RFC6334] (DHCPv6 Option for
              Dual-Stack Lite).  The IPv6 CE Router MAY use other
              mechanisms to configure DS-Lite parameters.  Such
              mechanisms are outside the scope of this document.

   DSLITE-2:  The CE Router SHOULD support IGD-PCP IWF [RFC6970] (UPnP
              Internet Gateway Device - Port Control Protocol
              Interworking Function).

   DSLITE-3:  If PCP ([RFC6887]) is implemented, the CE Router SHOULD
              also implement [RFC7291] (DHCP Options for the PCP).  If
              PCP ([RFC6887]) is implemented and a PCP server is not
              configured, the CE Router MUST assume, by default, that
              the AFTR is the PCP server.  A plain IPv6 mode is used to
              send PCP requests to the server.

   DSLITE-4:  The IPv6 CE Router MUST NOT perform IPv4 Network Address
              Translation (NAT) on IPv4 traffic encapsulated using DS-
              Lite ([RFC6333]).

3.3.3.  Lightweight 4over6 (lw4o6)

   Lw4o6 [RFC7596] specifies an extension to DS-Lite, which moves the
   NAPT function from the DS-Lite tunnel concentrator to the tunnel
   client located in the CE Router, removing the requirement for a CGN
   function in the tunnel concentrator and reducing the amount of
   centralized state.

   The CE Router SHOULD implement lw4o6 functionality.  If DS-Lite is
   implemented, lw4o6 SHOULD be supported as well.  If lw4o6 is
   supported, it MUST be implemented according to [RFC7596].  The
   following CE Router requirements also apply:

   Lw4o6 requirements:

   LW4O6-1:  The CE Router MUST support configuration of lw4o6 via the
             lw4o6 DHCPv6 options [RFC7598] (DHCPv6 Options for
             Configuration of Softwire Address and Port-Mapped Clients).
             The CE Router MAY use other mechanisms to configure lw4o6
             parameters.  Such mechanisms are outside the scope of this
             document.

   LW4O6-2:  The CE Router MUST support the DHCPv4-over-DHCPv6 (DHCP
             4o6) transport described in [RFC7341] (DHCPv4-over-DHCPv6
             Transport).

   LW4O6-3:  The CE Router MAY support Dynamic Allocation of Shared IPv4



Palet Martinez, et al.  Expires October 29, 2018                [Page 7]

Internet-Draft       IPv6 Transition CE for IPv4aaS           April 2018


             Addresses as described in [RFC7618] (Dynamic Allocation of
             Shared IPv4 Addresses).

3.3.4.  MAP-E

   MAP-E [RFC7597] is a mechanism for transporting IPv4 packets across
   an IPv6 network using IP encapsulation, including an algorithmic
   mechanism for mapping between IPv6 addresses and IPv4 addresses as
   well as transport-layer ports.

   The CE Router SHOULD support MAP-E functionality.  If MAP-E is
   supported, it MUST be implemented according to [RFC7597].  The
   following CE Router requirements also apply:

   MAP-E requirements:

   MAPE-1:  The CE Router MUST support configuration of MAP-E via the
            MAP-E DHCPv6 options [RFC7598] (DHCPv6 Options for
            Configuration of Softwire Address and Port-Mapped Clients).
            The CE Router MAY use other mechanisms to configure MAP-E
            parameters.  Such mechanisms are outside the scope of this
            document.

   MAPE-2:  The CE Router MAY support Dynamic Allocation of Shared IPv4
            Addresses as described in [RFC7618] (Dynamic Allocation of
            Shared IPv4 Addresses).

3.3.5.  MAP-T

   MAP-T [RFC7599] is a mechanism similar to MAP-E, differing from it in
   that MAP-T uses IPv4-IPv6 translation, rather than encapsulation, as
   the form of IPv6 domain transport.

   The CE Router SHOULD support MAP-T functionality.  If MAP-T is
   supported, it MUST be implemented according to [RFC7599].  The
   following CE Router requirements also apply:

   MAP-T requirements:

   MAPT-1:  The CE Router MUST support configuration of MAP-T via the
            MAP-T DHCPv6 options [RFC7598] (DHCPv6 Options for
            Configuration of Softwire Address and Port-Mapped Clients).
            The CE Router MAY use other mechanisms to configure MAP-T
            parameters.  Such mechanisms are outside the scope of this
            document.

   MAPT-2:  The CE Router MAY support Dynamic Allocation of Shared IPv4
            Addresses as described in [RFC7618] (Dynamic Allocation of



Palet Martinez, et al.  Expires October 29, 2018                [Page 8]

Internet-Draft       IPv6 Transition CE for IPv4aaS           April 2018


            Shared IPv4 Addresses).

4.  IPv4 Multicast Support

   Actual deployments support IPv4 multicast for services such as IPTV.
   In the transition phase it is expected that multicast services will
   still be provided using IPv4 to the customer LANs.

   If the CE Router supports delivery of IPv4 multicast services, then
   it MUST support [RFC8114] (Delivery of IPv4 Multicast Services to
   IPv4 Clients over an IPv6 Multicast Network) and [RFC8115] (DHCPv6
   Option for IPv4-Embedded Multicast and Unicast IPv6 Prefixes).

5.  UPnP IGD-PCP IWF Support

   UPnP MAY be enabled on the CE Router for stateless mechanisms that
   forward unsolicited inbound packets through to the CE.  If UPnP is
   enabled, the agent MUST reject any port mapping requests for ports
   outside of the range(s) allocated to the CE Router.

   UPnP SHOULD be disabled by default for stateful mechanisms that do
   not forward unsolicited inbound packets to the CE Router, unless
   implemented in conjunction with a method to control the external port
   mapping, such as IGD-PCP IWF [RFC6970].

6.  Update of RFC7084

   This document updates [RFC7084], by removing section 4.4 (Transition
   Technology Support), so all the transition related references of this
   document take preference over those in RFC7084.

   Namely, that means that 6rd [RFC5969]) is no longer considered and
   DS-LITE [RFC6333] requirements have been updated.

7.  Code Considerations

   One of the apparent main issues for vendors to include new
   functionalities, such as support for new transition mechanisms, is
   the lack of space in the flash (or equivalent) memory.  However, it
   has been confirmed from existing open source implementations
   (OpenWRT/LEDE, Linux, others), that adding the support for the new
   transitions mechanisms, requires around 10-12 Kbytes (because most of
   the code base is shared among several transition mechanisms already
   supported by [RFC7084]), as a single data plane is common to all
   them, which typically means about 0,15% of the existing code size in
   popular CEs already in the market.

   It is also clear that the new requirements don't have extra cost in



Palet Martinez, et al.  Expires October 29, 2018                [Page 9]

Internet-Draft       IPv6 Transition CE for IPv4aaS           April 2018


   terms of RAM memory, neither other hardware requirements such as more
   powerful CPUs.

   The other issue seems to be the cost of developing the code for those
   new functionalities.  However, at the time of writing this document,
   it has been confirmed that there are several open source versions of
   the required code for supporting the new transition mechanisms, and
   even several vendors already have implementations and provide it to
   ISPs, so the development cost is negligent, and only integration and
   testing cost may become a minor issue.

8.  Security Considerations

   The CE Router must comply with the Security Considerations as stated
   in [RFC7084], as well as those stated by each transition mechanism
   implemented by the CE Router.

9.  Acknowledgements

   Thanks to Mikael Abrahamsson, Mohamed Boucadair, Brian Carpenter, Lee
   Howard, Richard Patterson, Barbara Stark, Ole Troan, James Woodyatt,
   and "TBD", for their review and comments in this and previous
   versions of this document.

10.  Annex A: Usage Scenarios

   The situation previously described, where there is ongoing IPv6
   deployment and lack of IPv4 addresses, is not happening at the same
   pace at every country, and even within every country, every ISP.  For
   different technical, financial, commercial/marketing and socio-
   economic reasons, each network is transitioning at their own pace,
   and nobody has a magic crystal ball, to make a guess.

   Different studies (for example [IPv6Survey]) also show that this is a
   changing situation, because in a single country, it may be that not
   all operators provide IPv6 support, and consumers may switch ISPs and
   use the same CE Router with an ISP that provides IPv4-only and an ISP
   that provides IPv6 plus IPv4aaS.

   So, it is clear that, to cover all those evolving situations, a CE
   Router is required, at least from the perspective of the transition
   support, which can accommodate those changes.

   Moreover, because some services will remain IPv4-only for an
   undetermined time, and some service providers will remain IPv4-only
   for an undetermined period of time, IPv4 will be needed for an
   undetermined period of time.  There will be a need for CEs with
   support "IPv4 as-a-Service" for an undetermined period of time.



Palet Martinez, et al.  Expires October 29, 2018               [Page 10]

Internet-Draft       IPv6 Transition CE for IPv4aaS           April 2018


   This document is consequently, based on those premises, in order to
   ensure the continued transition from networks that today may provide
   access with dual-stack or IPv6-in-IPv4, as described in [RFC7084],
   and as an "extension" to it, evolving to an IPv6-only access with
   IPv4-as-a-Service.

   Considering that situation and different possible usage cases, the CE
   Router described in this document is expected to be used typically,
   in the following scenarios:

   1.  Residential/household, Small Office/Home Office (SOHO) and Small/
       Medium Enterprise (SME).  Common usage is any kind of Internet
       access (web, email, streaming, online gaming, etc.).

   2.  Residential/household and Small/Medium Enterprise (SME) with
       advanced requirements.  Same basic usage as for the previous
       case, however there may be requirements for allowing inbound
       connections (IP cameras, web, DNS, email, VPN, etc.).

   The above list is not intended to be comprehensive of all the
   possible usage scenarios, just an overall view.  In fact,
   combinations of the above usages are also possible, as well as
   situations where the same CE is used at different times in different
   scenarios or even different services providers that may use a
   different transition mechanism.

   The mechanisms for allowing inbound connections are "naturally"
   available in any IPv6 router, as when using GUA, unless they are
   blocked by firewall rules, which may require some manual
   configuration by means of a GUI and/or CLI.

   However, in the case of IPv4aaS, because the usage of private
   addresses and NAT and even depending on the specific transition
   mechanism, it typically requires some degree of more complex manual
   configuration such as setting up a DMZ, virtual servers, or port/
   protocol forwarding.  In general, IPv4 CE Routers already provide GUI
   and/or CLI to manually configure them, or the possibility to setup
   the CE in bridge mode, so another CE behind it, takes care of that.
   It is out of the scope of this document the definition of any
   requirements for that.

   The main difference for a CE Router to support the above indicated
   scenarios and number of users, is related to the packet processing
   capabilities, performance, even other details such as the number of
   WAN/LAN interfaces, their maximum speed, memory for keeping tables or
   tracking connections, etc.  It is out of the scope of this document
   to classify them.




Palet Martinez, et al.  Expires October 29, 2018               [Page 11]

Internet-Draft       IPv6 Transition CE for IPv4aaS           April 2018


   The actual bandwidth capabilities of access technologies such as
   FTTH, cable and even 3GPP/LTE, allows the support of such scenarios,
   and indeed, is a very common situation that access networks and CE
   Router provided by the service provider are the same for SMEs and
   residential users.

   There is also no difference in terms of who actually provides the CE
   Router.  In most of the cases is the service provider, and in fact is
   responsible, typically, of provisioning/managing at least the WAN
   side.  However, commonly the user has access to configure the LAN
   interfaces, firewall, DMZ, and many other features.  In fact, in many
   cases, the user must supply or may replace the CE Router; this makes
   even more relevant that all the CE Routers, support the same
   requirements defined in this document.

   The CE Router described in this document is not intended for usage in
   other scenarios such as large Enterprises, Data Centers, Content
   Providers, etc.  So, even if the documented requirements meet their
   needs, they may have additional requirements, which are out of the
   scope of this document.

11.  Annex B: End-User Network Architecture

   According to the descriptions in the preceding sections, an end-user
   network will likely support both IPv4 and IPv6.  It is not expected
   that an end user will change their existing network topology with the
   introduction of IPv6.  There are some differences in how IPv6 works
   and is provisioned; these differences have implications for the
   network architecture.

   A typical IPv4 end-user network consists of a "plug and play" router
   with NAT functionality and a single link upstream, connected to the
   service provider network.

   From the perspective of an "IPv4 user" behind an IPv6 transition
   Customer Edge Router with IPv4aaS, this doesn't change.

   However, while a typical IPv4 NAT deployment by default blocks all
   incoming connections and may allow opening of ports using a Universal
   Plug and Play Internet Gateway Device (UPnP IGD) [UPnP-IGD] or some
   other firewall control protocol, in the case of an IPv6-only access
   and IPv4aaS, that may not be feasible depending on specific
   transition mechanism details.  PCP (Port Control Protocol, [RFC6887])
   may be an alternative solution.

   Another consequence of using IPv4 private address space in the end-
   user network is that it provides stable addressing; that is, it never
   changes even when you change service providers, and the addresses are



Palet Martinez, et al.  Expires October 29, 2018               [Page 12]

Internet-Draft       IPv6 Transition CE for IPv4aaS           April 2018


   always there even when the WAN interface is down or the customer edge
   router has not yet been provisioned.  In the case of an IPv6-only
   access, there is no change on that if the transition mechanism keeps
   running the NAT interface towards the LAN side.

   More advanced routers support dynamic routing (which learns routes
   from other routers), and advanced end-users can build arbitrary,
   complex networks using manual configuration of address prefixes
   combined with a dynamic routing protocol.  Once again, this is true
   for both, IPv4 and IPv6.

   In general, the end-user network architecture for IPv6 should provide
   equivalent or better capabilities and functionality than the current
   IPv4 architecture.

   The end-user network is a stub network, in the sense that is not
   providing transit to other external networks.  However, HNCP
   ([RFC7788]) allows support for automatic provisioning of downstream
   routers.  Figure 1 illustrates the model topology for the end-user
   network.































Palet Martinez, et al.  Expires October 29, 2018               [Page 13]

Internet-Draft       IPv6 Transition CE for IPv4aaS           April 2018


                     +---------------+                      \
                     |   Service     |                       \
                     |   Provider    |                        | Service
                     |    Router     |                        | Provider
                     +-------+-------+                        | Network
                             |                               /
                             | Customer                     /
                             | Internet Connection         /
                             |
                      +------+--------+                    \
                      |     IPv6      |                     \
                      | Customer Edge |                      \
                      |    Router     |                      /
                      +---+-------+---+                     /
          Network A       |       |   Network B            |
    ---+----------------+-+-    --+---+-------------+--    |
       |                |             |             |       \
   +---+------+         |        +----+-----+ +-----+----+   \
   |IPv6 Host |         |        | IPv4 Host| |IPv4/IPv6 |   /
   |          |         |        |          | | Host     |  /
   +----------+         |        +----------+ +----------+ /
                        |                                 |
                 +------+--------+                        | End-User
                 |     IPv6      |                        | Network(s)
                 |    Router     |                         \
                 +------+--------+                          \
          Network C     |                                    \
    ---+-------------+--+---                                  |
       |             |                                        |
   +---+------+ +----+-----+                                  |
   |IPv6 Host | |IPv6 Host |                                 /
   |          | |          |                                /
   +----------+ +----------+                               /

            Figure 1: An Example of a Typical End-User Network

   This architecture describes the:

   o  Basic capabilities of the CE Router

   o  Provisioning of the WAN interface connecting to the service
      provider

   o  Provisioning of the LAN interfaces

   The CE Router may be manually configured in an arbitrary topology
   with a dynamic routing protocol or using HNCP ([RFC7788]).  Automatic
   provisioning and configuration is described for a single CE Router



Palet Martinez, et al.  Expires October 29, 2018               [Page 14]

Internet-Draft       IPv6 Transition CE for IPv4aaS           April 2018


   only.

12.  References

12.1.  Normative References

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119,
              DOI 10.17487/RFC2119, March 1997,
              <https://www.rfc-editor.org/info/rfc2119>.

   [RFC3633]  Troan, O. and R. Droms, "IPv6 Prefix Options for Dynamic
              Host Configuration Protocol (DHCP) version 6", RFC 3633,
              DOI 10.17487/RFC3633, December 2003,
              <https://www.rfc-editor.org/info/rfc3633>.

   [RFC5625]  Bellis, R., "DNS Proxy Implementation Guidelines",
              BCP 152, RFC 5625, DOI 10.17487/RFC5625, August 2009,
              <https://www.rfc-editor.org/info/rfc5625>.

   [RFC5969]  Townsley, W. and O. Troan, "IPv6 Rapid Deployment on IPv4
              Infrastructures (6rd) -- Protocol Specification",
              RFC 5969, DOI 10.17487/RFC5969, August 2010,
              <https://www.rfc-editor.org/info/rfc5969>.

   [RFC6146]  Bagnulo, M., Matthews, P., and I. van Beijnum, "Stateful
              NAT64: Network Address and Protocol Translation from IPv6
              Clients to IPv4 Servers", RFC 6146, DOI 10.17487/RFC6146,
              April 2011, <https://www.rfc-editor.org/info/rfc6146>.

   [RFC6333]  Durand, A., Droms, R., Woodyatt, J., and Y. Lee, "Dual-
              Stack Lite Broadband Deployments Following IPv4
              Exhaustion", RFC 6333, DOI 10.17487/RFC6333, August 2011,
              <https://www.rfc-editor.org/info/rfc6333>.

   [RFC6334]  Hankins, D. and T. Mrugalski, "Dynamic Host Configuration
              Protocol for IPv6 (DHCPv6) Option for Dual-Stack Lite",
              RFC 6334, DOI 10.17487/RFC6334, August 2011,
              <https://www.rfc-editor.org/info/rfc6334>.

   [RFC6877]  Mawatari, M., Kawashima, M., and C. Byrne, "464XLAT:
              Combination of Stateful and Stateless Translation",
              RFC 6877, DOI 10.17487/RFC6877, April 2013,
              <https://www.rfc-editor.org/info/rfc6877>.







Palet Martinez, et al.  Expires October 29, 2018               [Page 15]

Internet-Draft       IPv6 Transition CE for IPv4aaS           April 2018


   [RFC6887]  Wing, D., Ed., Cheshire, S., Boucadair, M., Penno, R., and
              P. Selkirk, "Port Control Protocol (PCP)", RFC 6887,
              DOI 10.17487/RFC6887, April 2013,
              <https://www.rfc-editor.org/info/rfc6887>.

   [RFC6970]  Boucadair, M., Penno, R., and D. Wing, "Universal Plug and
              Play (UPnP) Internet Gateway Device - Port Control
              Protocol Interworking Function (IGD-PCP IWF)", RFC 6970,
              DOI 10.17487/RFC6970, July 2013,
              <https://www.rfc-editor.org/info/rfc6970>.

   [RFC7050]  Savolainen, T., Korhonen, J., and D. Wing, "Discovery of
              the IPv6 Prefix Used for IPv6 Address Synthesis",
              RFC 7050, DOI 10.17487/RFC7050, November 2013,
              <https://www.rfc-editor.org/info/rfc7050>.

   [RFC7084]  Singh, H., Beebee, W., Donley, C., and B. Stark, "Basic
              Requirements for IPv6 Customer Edge Routers", RFC 7084,
              DOI 10.17487/RFC7084, November 2013,
              <https://www.rfc-editor.org/info/rfc7084>.

   [RFC7225]  Boucadair, M., "Discovering NAT64 IPv6 Prefixes Using the
              Port Control Protocol (PCP)", RFC 7225,
              DOI 10.17487/RFC7225, May 2014,
              <https://www.rfc-editor.org/info/rfc7225>.

   [RFC7291]  Boucadair, M., Penno, R., and D. Wing, "DHCP Options for
              the Port Control Protocol (PCP)", RFC 7291,
              DOI 10.17487/RFC7291, July 2014,
              <https://www.rfc-editor.org/info/rfc7291>.

   [RFC7341]  Sun, Q., Cui, Y., Siodelski, M., Krishnan, S., and I.
              Farrer, "DHCPv4-over-DHCPv6 (DHCP 4o6) Transport",
              RFC 7341, DOI 10.17487/RFC7341, August 2014,
              <https://www.rfc-editor.org/info/rfc7341>.

   [RFC7596]  Cui, Y., Sun, Q., Boucadair, M., Tsou, T., Lee, Y., and I.
              Farrer, "Lightweight 4over6: An Extension to the Dual-
              Stack Lite Architecture", RFC 7596, DOI 10.17487/RFC7596,
              July 2015, <https://www.rfc-editor.org/info/rfc7596>.

   [RFC7597]  Troan, O., Ed., Dec, W., Li, X., Bao, C., Matsushima, S.,
              Murakami, T., and T. Taylor, Ed., "Mapping of Address and
              Port with Encapsulation (MAP-E)", RFC 7597,
              DOI 10.17487/RFC7597, July 2015,
              <https://www.rfc-editor.org/info/rfc7597>.





Palet Martinez, et al.  Expires October 29, 2018               [Page 16]

Internet-Draft       IPv6 Transition CE for IPv4aaS           April 2018


   [RFC7598]  Mrugalski, T., Troan, O., Farrer, I., Perreault, S., Dec,
              W., Bao, C., Yeh, L., and X. Deng, "DHCPv6 Options for
              Configuration of Softwire Address and Port-Mapped
              Clients", RFC 7598, DOI 10.17487/RFC7598, July 2015,
              <https://www.rfc-editor.org/info/rfc7598>.

   [RFC7599]  Li, X., Bao, C., Dec, W., Ed., Troan, O., Matsushima, S.,
              and T. Murakami, "Mapping of Address and Port using
              Translation (MAP-T)", RFC 7599, DOI 10.17487/RFC7599, July
              2015, <https://www.rfc-editor.org/info/rfc7599>.

   [RFC7608]  Boucadair, M., Petrescu, A., and F. Baker, "IPv6 Prefix
              Length Recommendation for Forwarding", BCP 198, RFC 7608,
              DOI 10.17487/RFC7608, July 2015,
              <https://www.rfc-editor.org/info/rfc7608>.

   [RFC7618]  Cui, Y., Sun, Q., Farrer, I., Lee, Y., Sun, Q., and M.
              Boucadair, "Dynamic Allocation of Shared IPv4 Addresses",
              RFC 7618, DOI 10.17487/RFC7618, August 2015,
              <https://www.rfc-editor.org/info/rfc7618>.

   [RFC8026]  Boucadair, M. and I. Farrer, "Unified IPv4-in-IPv6
              Softwire Customer Premises Equipment (CPE): A DHCPv6-Based
              Prioritization Mechanism", RFC 8026, DOI 10.17487/RFC8026,
              November 2016, <https://www.rfc-editor.org/info/rfc8026>.

   [RFC8114]  Boucadair, M., Qin, C., Jacquenet, C., Lee, Y., and Q.
              Wang, "Delivery of IPv4 Multicast Services to IPv4 Clients
              over an IPv6 Multicast Network", RFC 8114,
              DOI 10.17487/RFC8114, March 2017,
              <https://www.rfc-editor.org/info/rfc8114>.

   [RFC8115]  Boucadair, M., Qin, J., Tsou, T., and X. Deng, "DHCPv6
              Option for IPv4-Embedded Multicast and Unicast IPv6
              Prefixes", RFC 8115, DOI 10.17487/RFC8115, March 2017,
              <https://www.rfc-editor.org/info/rfc8115>.

12.2.  Informative References

   [IPv6Survey]
              Palet Martinez, J., "IPv6 Deployment Survey", January
              2018,
              <https://indico.uknof.org.uk/event/41/contribution/5/
              material/slides/0.pdf>.

   [RFC7788]  Stenberg, M., Barth, S., and P. Pfister, "Home Networking
              Control Protocol", RFC 7788, DOI 10.17487/RFC7788, April
              2016, <https://www.rfc-editor.org/info/rfc7788>.



Palet Martinez, et al.  Expires October 29, 2018               [Page 17]

Internet-Draft       IPv6 Transition CE for IPv4aaS           April 2018


   [UPnP-IGD]
              UPnP Forum, "InternetGatewayDevice:2 Device Template
              Version 1.01", December 2010,
              <http://upnp.org/specs/gw/igd2/>.

Authors' Addresses

   Jordi Palet Martinez
   The IPv6 Company
   Molino de la Navata, 75
   La Navata - Galapagar, Madrid  28420
   Spain

   EMail: jordi.palet@theipv6company.com
   URI:   http://www.theipv6company.com/


   Hans M.-H. Liu
   D-Link Systems, Inc.
   17595 Mount Herrmann St.
   Fountain Valley, California  92708
   US

   EMail: hans.liu@dlinkcorp.com
   URI:   http://www.dlink.com/


   Masanobu Kawashima
   NEC Platforms, Ltd.
   800, Shimomata
   Kakegawa-shi, Shizuoka  436-8501
   Japan

   EMail: kawashimam@vx.jp.nec.com
   URI:   https://www.necplatforms.co.jp/en/
















Palet Martinez, et al.  Expires October 29, 2018               [Page 18]
